freebsdly/my_stm32_app2/stm32f429.svd.svd
        <register>
          <name>DCKCFGR</name>
          <displayName>DCKCFGR</displayName>
          <description>RCC Dedicated Clock Configuration
          Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLLI2SDIVQ</name>
              <description>PLLI2S division factor for SAI1
              clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>PLLI2SDIVQ</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>PLLI2SDIVQ = /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>PLLI2SDIVQ = /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div3</name>
                  <description>PLLI2SDIVQ = /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>PLLI2SDIVQ = /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div5</name>
                  <description>PLLI2SDIVQ = /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>PLLI2SDIVQ = /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div7</name>
                  <description>PLLI2SDIVQ = /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>PLLI2SDIVQ = /8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div9</name>
                  <description>PLLI2SDIVQ = /9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>PLLI2SDIVQ = /10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div11</name>
                  <description>PLLI2SDIVQ = /11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>PLLI2SDIVQ = /12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div13</name>
                  <description>PLLI2SDIVQ = /13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div14</name>
                  <description>PLLI2SDIVQ = /14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div15</name>
                  <description>PLLI2SDIVQ = /15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>PLLI2SDIVQ = /16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div17</name>
                  <description>PLLI2SDIVQ = /17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div18</name>
                  <description>PLLI2SDIVQ = /18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div19</name>
                  <description>PLLI2SDIVQ = /19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div20</name>
                  <description>PLLI2SDIVQ = /20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div21</name>
                  <description>PLLI2SDIVQ = /21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div22</name>
                  <description>PLLI2SDIVQ = /22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div23</name>
                  <description>PLLI2SDIVQ = /23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div24</name>
                  <description>PLLI2SDIVQ = /24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div25</name>
                  <description>PLLI2SDIVQ = /25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div26</name>
                  <description>PLLI2SDIVQ = /26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div27</name>
                  <description>PLLI2SDIVQ = /27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div28</name>
                  <description>PLLI2SDIVQ = /28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div29</name>
                  <description>PLLI2SDIVQ = /29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div30</name>
                  <description>PLLI2SDIVQ = /30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div31</name>
                  <description>PLLI2SDIVQ = /31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32</name>
                  <description>PLLI2SDIVQ = /32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSAIDIVQ</name>
              <description>PLLSAI division factor for SAI1
              clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>PLLSAIDIVQ</name>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>PLLSAIDIVQ = /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>PLLSAIDIVQ = /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div3</name>
                  <description>PLLSAIDIVQ = /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>PLLSAIDIVQ = /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div5</name>
                  <description>PLLSAIDIVQ = /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div6</name>
                  <description>PLLSAIDIVQ = /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div7</name>
                  <description>PLLSAIDIVQ = /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>PLLSAIDIVQ = /8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div9</name>
                  <description>PLLSAIDIVQ = /9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div10</name>
                  <description>PLLSAIDIVQ = /10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div11</name>
                  <description>PLLSAIDIVQ = /11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div12</name>
                  <description>PLLSAIDIVQ = /12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div13</name>
                  <description>PLLSAIDIVQ = /13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div14</name>
                  <description>PLLSAIDIVQ = /14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div15</name>
                  <description>PLLSAIDIVQ = /15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>PLLSAIDIVQ = /16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div17</name>
                  <description>PLLSAIDIVQ = /17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div18</name>
                  <description>PLLSAIDIVQ = /18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div19</name>
                  <description>PLLSAIDIVQ = /19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div20</name>
                  <description>PLLSAIDIVQ = /20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div21</name>
                  <description>PLLSAIDIVQ = /21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div22</name>
                  <description>PLLSAIDIVQ = /22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div23</name>
                  <description>PLLSAIDIVQ = /23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div24</name>
                  <description>PLLSAIDIVQ = /24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div25</name>
                  <description>PLLSAIDIVQ = /25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div26</name>
                  <description>PLLSAIDIVQ = /26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div27</name>
                  <description>PLLSAIDIVQ = /27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div28</name>
                  <description>PLLSAIDIVQ = /28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div29</name>
                  <description>PLLSAIDIVQ = /29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div30</name>
                  <description>PLLSAIDIVQ = /30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div31</name>
                  <description>PLLSAIDIVQ = /31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div32</name>
                  <description>PLLSAIDIVQ = /32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSAIDIVR</name>
              <description>division factor for
              LCD_CLK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PLLSAIDIVR</name>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>PLLSAIDIVR = /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>PLLSAIDIVR = /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>PLLSAIDIVR = /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div16</name>
                  <description>PLLSAIDIVR = /16</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1ASRC</name>
              <description>SAI1-A clock source
              selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SAI1ASRC</name>
                <enumeratedValue>
                  <name>PLLSAI</name>
                  <description>SAI1-A clock frequency = f(PLLSAI_Q) / PLLSAIDIVQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLI2S</name>
                  <description>SAI1-A clock frequency = f(PLLI2S_Q) / PLLI2SDIVQ</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <description>SAI1-A clock frequency = Alternate function input frequency</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1BSRC</name>
              <description>SAI1-B clock source
              selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SAI1BSRC</name>
                <enumeratedValue>
                  <name>PLLSAI</name>
                  <description>SAI1-B clock frequency = f(PLLSAI_Q) / PLLSAIDIVQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLI2S</name>
                  <description>SAI1-B clock frequency = f(PLLI2S_Q) / PLLI2SDIVQ</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <description>SAI1-B clock frequency = Alternate function input frequency</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPRE</name>
              <description>Timers clocks prescalers
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TIMPRE</name>
                <enumeratedValue>
                  <name>Mul1Or2</name>
                  <description>If the APB prescaler is configured 1, TIMxCLK = PCLKx. Otherwise, TIMxCLK = 2xPCLKx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mul1Or4</name>
                  <description>If the APB prescaler is configured 1, 2 or 4, TIMxCLK = HCLK. Otherwise, TIMxCLK = 4xPCLKx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
