freebsdly/my_stm32_app2/stm32f429.svd.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7</name>
      <groupName>TIM</groupName>
      <baseAddress>0x40001400</baseAddress>
      <interrupt>
        <name>TIM7</name>
        <description>TIM7 global interrupt</description>
        <value>55</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>Ethernet_MAC</name>
      <description>Ethernet: media access control
      (MAC)</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x61</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ETH_WKUP</name>
        <description>Ethernet Wakeup through EXTI line
        interrupt</description>
        <value>62</value>
      </interrupt>
      <registers>
        <register>
          <name>MACCR</name>
          <displayName>MACCR</displayName>
          <description>Ethernet MAC configuration
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC receive state machine is disabled after the completion of the reception of the current frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC receive state machine is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC transmit state machine is disabled after completion of the transmission of the current frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC transmit state machine is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC</name>
              <description>Deferral check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DC</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC defers until CRS signal goes inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Deferral check function enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Back-off limit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BL</name>
                <enumeratedValue>
                  <name>BL10</name>
                  <description>For retransmission n, wait up to 2^min(n, 10) time slots</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL8</name>
                  <description>For retransmission n, wait up to 2^min(n, 8) time slots</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL4</name>
                  <description>For retransmission n, wait up to 2^min(n, 4) time slots</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL1</name>
                  <description>For retransmission n, wait up to 2^min(n, 1) time slots</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APCS</name>
              <description>Automatic pad/CRC stripping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>APCS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC passes all incoming frames unmodified</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Strip</name>
                  <description>MAC strips the Pad/FCS field on incoming frames only for lengths less than or equal to 1500 bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD</name>
              <description>Retry disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC attempts retries based on the settings of BL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC attempts only 1 transmission</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCO</name>
              <description>IPv4 checksum offload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IPCO</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>IPv4 checksum offload disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offload</name>
                  <description>IPv4 checksums are checked in received frames</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DM</name>
                <enumeratedValue>
                  <name>HalfDuplex</name>
                  <description>MAC operates in half-duplex mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FullDuplex</name>
                  <description>MAC operates in full-duplex mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LM</name>
              <description>Loopback mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LM</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Loopback</name>
                  <description>MAC operates in loopback mode at the MII</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROD</name>
              <description>Receive own disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ROD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC receives all packets from PHY while transmitting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC disables reception of frames in half-duplex mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FES</name>
              <description>Fast Ethernet speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FES</name>
                <enumeratedValue>
                  <name>FES10</name>
                  <description>10 Mbit/s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FES100</name>
                  <description>100 Mbit/s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSD</name>
              <description>Carrier sense disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CSD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Errors generated due to loss of carrier</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No error generated due to loss of carrier</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFG</name>
              <description>Interframe gap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>IFG</name>
                <enumeratedValue>
                  <name>IFG96</name>
                  <description>96 bit times</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG88</name>
                  <description>88 bit times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG80</name>
                  <description>80 bit times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG72</name>
                  <description>72 bit times</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG64</name>
                  <description>64 bit times</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG56</name>
                  <description>56 bit times</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG48</name>
                  <description>48 bit times</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFG40</name>
                  <description>40 bit times</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>JD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Jabber enabled, transmit frames up to 2048 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Jabber disabled, transmit frames up to 16384 bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD</name>
              <description>Watchdog disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Watchdog enabled, receive frames limited to 2048 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Watchdog disabled, receive frames may be up to to 16384 bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSTF</name>
              <description>CRC stripping for type frames</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CSTF</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC not stripped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CRC stripped</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
