freebsdly/my_stm32_app2/stm32f429.svd.svd
        <register>
          <name>MACFFR</name>
          <displayName>MACFFR</displayName>
          <description>Ethernet MAC frame filter
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PM</name>
              <description>Promiscuous mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PM</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Normal address filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address filters pass all incoming frames regardless of their destination or source address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HU</name>
              <description>Hash unicast</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HU</name>
                <enumeratedValue>
                  <name>Perfect</name>
                  <description>MAC performs a perfect destination address filtering for unicast frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hash</name>
                  <description>MAC performs destination address filtering of received unicast frames according to the hash table</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HM</name>
              <description>Hash multicast</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HM</name>
                <enumeratedValue>
                  <name>Perfect</name>
                  <description>MAC performs a perfect destination address filtering for multicast frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hash</name>
                  <description>MAC performs destination address filtering of received multicast frames according to the hash table</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAIF</name>
              <description>Destination address unique filtering</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DAIF</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal filtering of frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Invert</name>
                  <description>Address check block operates in inverse filtering mode for the DA address comparison</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAM</name>
              <description>Pass all multicast</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PAM</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Filtering of multicast frames depends on HM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>All received frames with a multicast destination address are passed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFD</name>
              <description>Broadcast frames disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BFD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address filters pass all received broadcast frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address filters filter all incoming broadcast frames</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass control frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PCF</name>
                <enumeratedValue>
                  <name>PreventAll</name>
                  <description>MAC prevents all control frames from reaching the application</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForwardAllExceptPause</name>
                  <description>MAC forwards all control frames to application except Pause</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForwardAll</name>
                  <description>MAC forwards all control frames to application even if they fail the address filter</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForwardAllFiltered</name>
                  <description>MAC forwards control frames that pass the address filter</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAIF</name>
              <description>Source address inverse filtering</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SAIF</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Source address filter operates normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Invert</name>
                  <description>Source address filter operation inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAF</name>
              <description>Source address filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SAF</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Source address ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC drops frames that fail the source address filter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or perfect filter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HPF</name>
                <enumeratedValue>
                  <name>HashOnly</name>
                  <description>If HM or HU is set, only frames that match the Hash filter are passed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HashOrPerfect</name>
                  <description>If HM or HU is set, frames that match either the perfect filter or the hash filter are passed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RA</name>
              <description>Receive all</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RA</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC receiver passes on to the application only those frames that have passed the SA/DA address file</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC receiver passes oll received frames on to the application</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTHR</name>
          <displayName>MACHTHR</displayName>
          <description>Ethernet MAC hash table high
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTH</name>
              <description>Upper 32 bits of hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTLR</name>
          <displayName>MACHTLR</displayName>
          <description>Ethernet MAC hash table low
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTL</name>
              <description>Lower 32 bits of hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIAR</name>
          <displayName>MACMIIAR</displayName>
          <description>Ethernet MAC MII address
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB</name>
              <description>MII busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MB</name>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>This bit is set to 1 by the application to indicate that a read or write access is in progress</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MW</name>
              <description>MII write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MW</name>
                <enumeratedValue>
                  <name>Read</name>
                  <description>Read operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Write</name>
                  <description>Write operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CR</name>
              <description>Clock range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CR</name>
                <enumeratedValue>
                  <name>CR_60_100</name>
                  <description>60-100MHz HCLK/42</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CR_100_150</name>
                  <description>100-150 MHz HCLK/62</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CR_20_35</name>
                  <description>20-35MHz HCLK/16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CR_35_60</name>
                  <description>35-60MHz HCLK/16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CR_150_168</name>
                  <description>150-168MHz HCLK/102</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MR</name>
              <description>MII register - select the desired MII register in the PHY device</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PA</name>
              <description>PHY address - select which of possible 32 PHYs is being accessed</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIDR</name>
          <displayName>MACMIIDR</displayName>
          <description>Ethernet MAC MII data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MD</name>
              <description>MII data read from/written to the PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACFCR</name>
          <displayName>MACFCR</displayName>
          <description>Ethernet MAC flow control
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FCB</name>
              <description>Flow control busy/back pressure activate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FCB</name>
                <enumeratedValue>
                  <name>DisableBackPressure</name>
                  <description>In half duplex only, deasserts back pressure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PauseOrBackPressure</name>
                  <description>In full duplex, initiate a Pause control frame. In half duplex, assert back pressure</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFCE</name>
              <description>Transmit flow control enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TFCE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>In full duplex, flow control is disabled. In half duplex, back pressure is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>In full duplex, flow control is enabled. In half duplex, back pressure is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFCE</name>
              <description>Receive flow control enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RFCE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Pause frames are not decoded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC decodes received Pause frames and disables its transmitted for a specified time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPFD</name>
              <description>Unicast pause frame detect</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UPFD</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>MAC detects only a Pause frame with the multicast address specified in the 802.3x standard</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MAC additionally detects Pause frames with the station's unicast address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause low threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PLT</name>
                <enumeratedValue>
                  <name>PLT4</name>
                  <description>Pause time minus 4 slot times</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLT28</name>
                  <description>Pause time minus 28 slot times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLT144</name>
                  <description>Pause time minus 144 slot times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLT256</name>
                  <description>Pause time minus 256 slot times</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZQPD</name>
              <description>Zero-quanta pause disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ZQPD</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Normal operation with automatic zero-quanta pause control frame generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Automatic generation of zero-quanta pause control frames is disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>Pause time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
