freebsdly/my_stm32_app2/stm32f429.svd.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Ethernet_PTP</name>
      <description>Ethernet: Precision time protocol</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40028700</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTPTSCR</name>
          <displayName>PTPTSCR</displayName>
          <description>Ethernet PTP time stamp control
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSFCU</name>
              <description>TSFCU</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSPTPPSV2E</name>
              <description>TSPTPPSV2E</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSPTPOEFE</name>
              <description>TSSPTPOEFE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSIPV6FE</name>
              <description>TSSIPV6FE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSIPV4FE</name>
              <description>TSSIPV4FE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSEME</name>
              <description>TSSEME</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSMRME</name>
              <description>TSSMRME</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSCNT</name>
              <description>TSCNT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TSPFFMAE</name>
              <description>TSPFFMAE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSTI</name>
              <description>TSSTI</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSTU</name>
              <description>TSSTU</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSITE</name>
              <description>TSITE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TTSARU</name>
              <description>TTSARU</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSARFE</name>
              <description>TSSARFE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSSR</name>
              <description>TSSSR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPSSIR</name>
          <displayName>PTPSSIR</displayName>
          <description>Ethernet PTP subsecond increment
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STSSI</name>
              <description>STSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSHR</name>
          <displayName>PTPTSHR</displayName>
          <description>Ethernet PTP time stamp high
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STS</name>
              <description>STS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSLR</name>
          <displayName>PTPTSLR</displayName>
          <description>Ethernet PTP time stamp low
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STSS</name>
              <description>STSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>STPNS</name>
              <description>STPNS</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSHUR</name>
          <displayName>PTPTSHUR</displayName>
          <description>Ethernet PTP time stamp high update
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSUS</name>
              <description>TSUS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSLUR</name>
          <displayName>PTPTSLUR</displayName>
          <description>Ethernet PTP time stamp low update
          register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSUSS</name>
              <description>TSUSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>TSUPNS</name>
              <description>TSUSS</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSAR</name>
          <displayName>PTPTSAR</displayName>
          <description>Ethernet PTP time stamp addend
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSA</name>
              <description>TSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTTHR</name>
          <displayName>PTPTTHR</displayName>
          <description>Ethernet PTP target time high
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TTSH</name>
              <description>0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTTLR</name>
          <displayName>PTPTTLR</displayName>
          <description>Ethernet PTP target time low
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TTSL</name>
              <description>TTSL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPTSSR</name>
          <displayName>PTPTSSR</displayName>
          <description>Ethernet PTP time stamp status
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSO</name>
              <description>TSSO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTTR</name>
              <description>TSTTR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPPPSCR</name>
          <displayName>PTPPPSCR</displayName>
          <description>Ethernet PTP PPS control
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPSFREQ</name>
              <description>PPS frequency selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PPSFREQ</name>
                <enumeratedValue>
                  <name>Hz_1</name>
                  <description>1 Hz with a pulse width of 125 ms for binary rollover and of 100 ms for digital rollover</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_2</name>
                  <description>2 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_4</name>
                  <description>4 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_8</name>
                  <description>8 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_16</name>
                  <description>16 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_32</name>
                  <description>32 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_64</name>
                  <description>64 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_128</name>
                  <description>128 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_256</name>
                  <description>256 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_512</name>
                  <description>512 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_1024</name>
                  <description>1024 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_2048</name>
                  <description>2048 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_4096</name>
                  <description>4096 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_8192</name>
                  <description>8192 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_16384</name>
                  <description>16384 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz_32768</name>
                  <description>32768 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
